Catalogs/ПЛ_УведомленияОСобытиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПЛ_УведомленияОСобытиях</Name>
			<Comment>Содержит настройки рассылок и уведомлений заинтересованных лиц о событиях, происходящие в системе</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПЛ_События</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбычныйТекст</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаШаблонаТекстовСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиШаблонаТекстовСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелениеПоАдресатам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ДелениеУведомленийПоАдресатам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПоАдресатам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольПовторнойОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_СпособыДоставкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисПочтовойРассылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Напоминание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАдресацииУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПЛ_СпособыАдресацииУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адресат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаВыборкиАдресатов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиВыборкиАдресатов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСхемыВыборкиАдресатов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроекВыборкиАдресатов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПЛ_ВидыУсловийУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСхемыУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроекУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицыШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроек</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПечатнаяФорма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Внешняя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрисоединенныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПЛ_СпособыАдресацииУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_СпособыАдресацииУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерТелефона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицоКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокРассылки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_ИсточникиСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ИсточникиСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсточникЗаписьДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникРегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентнаяПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_ВидыУсловийУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ВидыУсловийУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтборПоИсточнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_ДелениеУведомленийПоАдресатам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ДелениеУведомленийПоАдресатам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщееДляВсех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкрытыеКопии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельноКаждому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_СпособыДоставкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_СпособыДоставкиУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисПочтовойРассылки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСообщение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПЛ_УведомленияОСобытиях/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает массив уведомлений, представляющих собой структуры, содержащие адресатов и тексты сообщений
//
// Параметры
//    МассивСобытий - Массив - массив событий, для которых будут выбраны уведомления
//    ТипИсточника - ПеречислениеСсылка.ПЛ_ИсточникиСобытий - тип источника события
//    Источник - ЛюбаяСсылка - ссылка на источник события
//
// Возвращаемое значение: массив структур уведомлений
//
Функция УведомленияПоСобытиям(События, ТипИсточника, Источник, МассивУведомлений = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Уведомления.Ссылка КАК Ссылка,
	|	Уведомления.Событие КАК Событие,
	|	Уведомления.Событие.ИсточникСобытия КАК ИсточникСобытия,
	|	Уведомления.ЭлПочта КАК ЭлПочта,
	|	Уведомления.СервисПочтовойРассылки КАК СервисПочтовойРассылки,
	|	Уведомления.СМС КАК СМС,
	|	Уведомления.Напоминание КАК Напоминание,
	|	Уведомления.СпособДоставки КАК СпособДоставки,
	|	Уведомления.Получатели.(
	|		СпособАдресацииУведомления,
	|		Адресат,
	|		ВЫБОР
	|			КОГДА СпособАдресацииУведомления = ЗНАЧЕНИЕ(Перечисление.ПЛ_СпособыАдресацииУведомлений.СписокРассылки) ТОГДА
	|				ВЫРАЗИТЬ(Адресат КАК Справочник.ПЛ_Подписчики).СхемаВыборки
	|		ИНАЧЕ
	|			СхемаВыборкиАдресатов
	|		КОНЕЦ КАК СхемаВыборкиАдресатов,
	|		ВЫБОР
	|			КОГДА СпособАдресацииУведомления = ЗНАЧЕНИЕ(Перечисление.ПЛ_СпособыАдресацииУведомлений.СписокРассылки) ТОГДА
	|				ВЫРАЗИТЬ(Адресат КАК Справочник.ПЛ_Подписчики).НастройкиВыборки
	|		ИНАЧЕ
	|			НастройкиВыборкиАдресатов
	|		КОНЕЦ КАК НастройкиВыборкиАдресатов,
	|		ВидУсловийОтправкиУведомления,
	|		СхемаУсловийОтправкиУведомления,
	|		НастройкиУсловийОтправкиУведомления,
	|		ВЫБОР
	|			КОГДА СпособАдресацииУведомления = ЗНАЧЕНИЕ(Перечисление.ПЛ_СпособыАдресацииУведомлений.СписокРассылки) ТОГДА
	|				ВЫРАЗИТЬ(Адресат КАК Справочник.ПЛ_Подписчики).ВидыКонтактнойИнформации
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ВидыКонтактнойИнформации,
	|		ВЫБОР
	|			КОГДА СпособАдресацииУведомления = ЗНАЧЕНИЕ(Перечисление.ПЛ_СпособыАдресацииУведомлений.СписокРассылки) ТОГДА
	|				ВЫРАЗИТЬ(Адресат КАК Справочник.ПЛ_Подписчики).ВидыКонтактнойИнформацииДополнительно
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ВидыКонтактнойИнформацииДополнительно
	|	),
	|	Уведомления.ДелениеПоАдресатам КАК ДелениеПоАдресатам,
	|	Уведомления.ФильтрПоАдресатам КАК ФильтрПоАдресатам,
	|	Уведомления.Наименование КАК Тема,
	|	Уведомления.ТекстСообщения КАК Текст,
	|	Уведомления.ОбычныйТекст КАК ОбычныйТекст,
	|	Уведомления.КонтрольПовторнойОтправки КАК КонтрольПовторнойОтправки,
	|	Уведомления.ИмяОтправителя КАК ИмяОтправителя,
	|	Уведомления.ОбратныйАдрес КАК ОбратныйАдрес,
	|	Уведомления.СхемаШаблонаТекстовСообщения КАК СхемаШаблонаТекстовСообщения,
	|	Уведомления.НастройкиШаблонаТекстовСообщения КАК НастройкиШаблонаТекстовСообщения,
	|	Уведомления.ТаблицыШаблонов.(
	|		Имя,
	|		Настройки,
	|		Вложение,
	|		АдресНастроек
	|	),
	|	Уведомления.Вложения.(
	|		Имя,
	|		Вложение,
	|		Идентификатор,
	|		Картинка
	|	),
	|	Уведомления.ПечатныеФормы.(
	|		ПечатнаяФорма,
	|		Внешняя
	|	),
	|	Уведомления.ФорматВложений КАК ФорматВложений,
	|	Уведомления.ПрисоединенныеФайлы.(
	|		Имя,
	|		Вложение
	|	)
	|ИЗ
	|	Справочник.ПЛ_УведомленияОСобытиях КАК Уведомления
	|ГДЕ
	|	НЕ Уведомления.ПометкаУдаления
	|	И Уведомления.Получатели.Включен
	|	И Уведомления.Событие В(&События)
	|	И (Уведомления.Ссылка В(&МассивУведомлений)
	|		ИЛИ &МассивУведомленийНеЗаполнен)
	|	И Уведомления.Статус = 1
	|";
	
	Запрос.УстановитьПараметр("События", События);
	Запрос.УстановитьПараметр("МассивУведомлений", МассивУведомлений);
	Запрос.УстановитьПараметр("МассивУведомленийНеЗаполнен", Не ЗначениеЗаполнено(МассивУведомлений));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Уведомления = Новый Массив;
	
	ВыборкаУведомлений = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУведомлений.Следующий() Цикл
		
		ХешКонтрольнойСуммы = ПЛ_Функции83.ХешКонтрольнойСуммы();
		
		ТаблицыШаблонов = ВыборкаУведомлений.ТаблицыШаблонов.Выгрузить();
		
		Для каждого ТаблицаШаблона из ТаблицыШаблонов Цикл
			ТаблицаШаблона.АдресНастроек = ПоместитьВоВременноеХранилище(ТаблицаШаблона.Настройки.Получить(), Новый УникальныйИдентификатор);
		КонецЦикла;
		
		ТаблицаВложений = ВыборкаУведомлений.Вложения.Выгрузить();
		ТаблицаПрисоединенныхФайлов = ВыборкаУведомлений.ПрисоединенныеФайлы.Выгрузить();
		
		Для каждого СтрокаПрисоединенногоФайла из ТаблицаПрисоединенныхФайлов Цикл
			ПЛ_Функции83.ДобавитьДанныеВХеш(ХешКонтрольнойСуммы, СтрокаПрисоединенногоФайла.Вложение.Получить());
		КонецЦикла;
		
		Если ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
			Или ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента
			Или ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник Тогда
			
			Попытка
				ПечатныеФормы = СформироватьПечатныеФормы(Источник, ВыборкаУведомлений.ПечатныеФормы.Выгрузить(), ВыборкаУведомлений.ФорматВложений, ХешКонтрольнойСуммы);
			Исключение
				ПечатныеФормы = Неопределено;
			КонецПопытки;
			
		Иначе
			ПечатныеФормы = Неопределено;
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,, "Получим вложения для уведомлений: начало");	
		АдресСхемыШаблонов = ПоместитьВоВременноеХранилище(ВыборкаУведомлений.СхемаШаблонаТекстовСообщения.Получить(), Новый УникальныйИдентификатор);
		
		Для каждого ТаблицаШаблона из ТаблицыШаблонов Цикл
			
			Если ТаблицаШаблона.Вложение Тогда
				
				Если ПечатныеФормы = Неопределено Тогда
					ПечатныеФормы = Новый Массив;
				КонецЕсли;
				
				ДобавитьТаблицуШаблонаВМассивПечатныхФорм(ПечатныеФормы, ТаблицаШаблона, АдресСхемыШаблонов, "XLSX", ХешКонтрольнойСуммы);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Получим вложения для уведомлений: окончание");	
		
		КонтрольнаяСумма = ПЛ_Функции83.КонтрольнаяСумма(ХешКонтрольнойСуммы);
		
		АдресатыРасширенно = Новый ТаблицаЗначений;
		АдресатыРасширенно.Колонки.Добавить("Адресат");
		АдресатыРасширенно.Колонки.Добавить("Адрес");
		АдресатыРасширенно.Колонки.Добавить("Идентификатор");
		
		ПоляВыбораАдресатов = Новый Массив;
		
		ВыборкаАдресатов = ВыборкаУведомлений.Получатели.Выбрать();
		
		Пока ВыборкаАдресатов.Следующий() Цикл
			
			ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Проверка условия отправки: начало");	
			УсловияОтправкиВыполнены = Истина;
			
			Если ВыборкаАдресатов.ВидУсловийОтправкиУведомления = Перечисления.ПЛ_ВидыУсловийУведомлений.БезУсловия
				Или Не ЗначениеЗаполнено(ВыборкаАдресатов.ВидУсловийОтправкиУведомления) Тогда
				УсловияОтправкиВыполнены = Истина;
			Иначе
				
				АдресСхемыУсловий = ПоместитьВоВременноеХранилище(ВыборкаАдресатов.СхемаУсловийОтправкиУведомления.Получить(), Новый УникальныйИдентификатор);
				АдресНастроекУсловий = ПоместитьВоВременноеХранилище(ВыборкаАдресатов.НастройкиУсловийОтправкиУведомления.Получить(), Новый УникальныйИдентификатор);
				УсловияОтправкиВыполнены = ПЛ_УведомленияОСобытиях.ПроверитьУсловие(
					ВыборкаУведомлений.ИсточникСобытия,
					Источник,
					АдресСхемыУсловий,
					АдресНастроекУсловий);
				
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Проверка условия отправки: окончание");	
			
			Если УсловияОтправкиВыполнены Тогда
				
				ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Получаем адресатов: начало");	
				
				Если ВыборкаАдресатов.СпособАдресацииУведомления = Перечисления.ПЛ_СпособыАдресацииУведомлений.Запрос Тогда
					
					АдресСхемыВыборкиАдресатов = ПоместитьВоВременноеХранилище(ВыборкаАдресатов.СхемаВыборкиАдресатов.Получить(), Новый УникальныйИдентификатор);
					АдресНастроекВыборкиАдресатов = ПоместитьВоВременноеХранилище(ВыборкаАдресатов.НастройкиВыборкиАдресатов.Получить(), Новый УникальныйИдентификатор);
					
					СписокАдресатов = ПЛ_УведомленияОСобытиях.ПолучитьСписокАдресатов(
						ТипИсточника, Источник,
						АдресСхемыВыборкиАдресатов, АдресНастроекВыборкиАдресатов,
						ПоляВыбораАдресатов);
						
					Для каждого Адресат из СписокАдресатов Цикл
						
						НовыйАдресатРасширенно = АдресатыРасширенно.Добавить();
						НовыйАдресатРасширенно.Адресат = Адресат;
						НовыйАдресатРасширенно.Адрес = ПолучитьАдрес(ВыборкаУведомлений, Адресат);
						НовыйАдресатРасширенно.Идентификатор = ИдентификаторАдресата(Адресат);
						
					КонецЦикла;
					
				ИначеЕсли ВыборкаАдресатов.СпособАдресацииУведомления = Перечисления.ПЛ_СпособыАдресацииУведомлений.СписокРассылки Тогда
					
					Справочники.ПЛ_Подписчики.ЗаполнитьАдресатовПоСпискуРассылки(
						ВыборкаАдресатов.Адресат,
						АдресатыРасширенно,
						ВыборкаУведомлений.СпособДоставки);
					
				Иначе
					
					НовыйАдресатРасширенно = АдресатыРасширенно.Добавить();
					НовыйАдресатРасширенно.Адресат = ВыборкаАдресатов.Адресат;
					НовыйАдресатРасширенно.Адрес = ПолучитьАдрес(ВыборкаУведомлений, ВыборкаАдресатов.Адресат);
					НовыйАдресатРасширенно.Идентификатор = ИдентификаторАдресата(ВыборкаАдресатов.Адресат);
					
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Получаем адресатов: окончание");	
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если АдресатыРасширенно.Количество() Тогда
			
			УдалитьПовторяющиесяЭлементыТаблицыЗначений(АдресатыРасширенно, "Адресат");
			
			Тема = ВыборкаУведомлений.Тема;
			Текст = ВыборкаУведомлений.Текст;
			
			АдресСхемыШаблонов = ПоместитьВоВременноеХранилище(ВыборкаУведомлений.СхемаШаблонаТекстовСообщения.Получить(), Новый УникальныйИдентификатор);
			АдресНастроекШаблонов = ПоместитьВоВременноеХранилище(ВыборкаУведомлений.НастройкиШаблонаТекстовСообщения.Получить(), Новый УникальныйИдентификатор);
			
			// Общий текст сообщения для всех адресатов
			Если Не ВыборкаУведомлений.ФильтрПоАдресатам Тогда
				
				ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Формируем текст сообщения: начало");	
				
				Попытка
					ПЛ_УведомленияОСобытиях.ТекстыПоШаблонам(ТипИсточника, Источник,
						АдресСхемыШаблонов, АдресНастроекШаблонов,
						ТаблицыШаблонов, ВыборкаУведомлений.ОбычныйТекст,
						Тема, Текст);
				Исключение
					
					ТекстОшибки = НСтр("ru = 'Не удалось сформировать текст по шаблону по причине: %Причина%'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
						УровеньЖурналаРегистрации.Предупреждение,
						,
						,
						ТекстОшибки);
					Возврат Неопределено;
					
				КонецПопытки;
					ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Формируем текст сообщения: окончание");	
				
				Если ВыборкаУведомлений.ДелениеПоАдресатам = Перечисления.ПЛ_ДелениеУведомленийПоАдресатам.ОтдельноКаждому
					// В случае отправки через сервис рассылки, разбивку на отдельные письма произведет он сам
					И ВыборкаУведомлений.СпособДоставки <> Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки Тогда
					
					Для каждого СтрокаАдресат Из АдресатыРасширенно Цикл
						
						СтруктураУведомления = ИнициализироватьСтруктуруУведомления();
						СтруктураУведомления.Уведомление         = ВыборкаУведомлений.Ссылка;
						СтруктураУведомления.Событие             = ВыборкаУведомлений.Событие;
						ЗаполнитьЗначенияСвойств(СтруктураУведомления, ВыборкаУведомлений,
							"ИсточникСобытия, КонтрольПовторнойОтправки, ОбычныйТекст, ОбратныйАдрес, ДелениеПоАдресатам, ИмяОтправителя, СпособДоставки");
						
						СтруктураУведомления.Тема                = Тема;
						СтруктураУведомления.Текст               = Текст;
						СтруктураУведомления.ТаблицаВложений     = ТаблицаВложений;
						СтруктураУведомления.ПечатныеФормы       = ПечатныеФормы;
						СтруктураУведомления.ПрисоединенныеФайлы = ТаблицаПрисоединенныхФайлов;
						СтруктураУведомления.КонтрольнаяСумма    = КонтрольнаяСумма;
						
						АдресРасширенно = СтруктураАдресатРасширенно();
						ЗаполнитьЗначенияСвойств(АдресРасширенно, СтрокаАдресат);
						АдресаРасширенно = Новый Массив;
						АдресаРасширенно.Добавить(АдресРасширенно);
						СтруктураУведомления.АдресатыРасширенно = АдресаРасширенно;
						
						Уведомления.Добавить(СтруктураУведомления);
						
					КонецЦикла;
				Иначе
					
					СтруктураУведомления = ИнициализироватьСтруктуруУведомления();
					СтруктураУведомления.Уведомление         = ВыборкаУведомлений.Ссылка;
					СтруктураУведомления.Событие             = ВыборкаУведомлений.Событие;
					ЗаполнитьЗначенияСвойств(СтруктураУведомления, ВыборкаУведомлений,
						"ИсточникСобытия, КонтрольПовторнойОтправки, ОбычныйТекст, ОбратныйАдрес, ДелениеПоАдресатам, ИмяОтправителя, СпособДоставки");
					
					СтруктураУведомления.Тема                = Тема;
					СтруктураУведомления.Текст               = Текст;
					СтруктураУведомления.ТаблицаВложений     = ТаблицаВложений;
					СтруктураУведомления.ПечатныеФормы       = ПечатныеФормы;
					СтруктураУведомления.ПрисоединенныеФайлы = ТаблицаПрисоединенныхФайлов;
					СтруктураУведомления.КонтрольнаяСумма    = КонтрольнаяСумма;
					
					АдресаРасширенно = Новый Массив;
					
					Для каждого СтрокаАдресат Из АдресатыРасширенно Цикл
						
						АдресРасширенно = СтруктураАдресатРасширенно();
						ЗаполнитьЗначенияСвойств(АдресРасширенно, СтрокаАдресат);
						АдресаРасширенно.Добавить(АдресРасширенно);
						
					КонецЦикла;
					
					СтруктураУведомления.АдресатыРасширенно = АдресаРасширенно;
					
					Уведомления.Добавить(СтруктураУведомления);
					
				КонецЕсли;
				
			// Выборка при отправке отдельно каждому адресату фильтруется для отбора данных каждого адресата в отдельности
			Иначе
				
				ТаблицаАдресатов = Новый ТаблицаЗначений;
				ТаблицаАдресатов.Колонки.Добавить("Адресат");
				ТаблицаАдресатов.Колонки.Добавить("Тема");
				ТаблицаАдресатов.Колонки.Добавить("Текст");
				
				Для каждого СтрокаАдресат Из АдресатыРасширенно Цикл
					НоваяСтрока = ТаблицаАдресатов.Добавить();
					НоваяСтрока.Адресат = СтрокаАдресат.Адресат;
				КонецЦикла;
				
				Попытка
					
					ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Формируем текст сообщения: начало");	
					ПЛ_УведомленияОСобытиях.ДополнитьТаблицуАдресатовТекстамиПоШаблонам(ТипИсточника, Источник,
						АдресСхемыШаблонов, АдресНастроекШаблонов,
						ТаблицыШаблонов, ВыборкаУведомлений.ОбычныйТекст,
						Тема, Текст,
						ТаблицаАдресатов, ПоляВыбораАдресатов);
					ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Формируем текст сообщения: окончание");	
					
				Исключение
					
					ТекстСообщения = НСтр("ru = 'Не удалось сформировать текст по шаблону по причине: %Причина%'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
						УровеньЖурналаРегистрации.Предупреждение,
						,
						,
						ТекстСообщения);
					Возврат Неопределено;
					
				КонецПопытки;
				
				Для каждого СтрокаАдресата из ТаблицаАдресатов Цикл
					
					СтруктураУведомления = ИнициализироватьСтруктуруУведомления();
					СтруктураУведомления.Уведомление         = ВыборкаУведомлений.Ссылка;
					СтруктураУведомления.Событие             = ВыборкаУведомлений.Событие;
					ЗаполнитьЗначенияСвойств(СтруктураУведомления, ВыборкаУведомлений,
						"ИсточникСобытия, КонтрольПовторнойОтправки, ОбычныйТекст, ОбратныйАдрес, ДелениеПоАдресатам, ИмяОтправителя, СпособДоставки");
						
					СтруктураУведомления.Тема                = СтрокаАдресата.Тема;
					СтруктураУведомления.Текст               = СтрокаАдресата.Текст;
					СтруктураУведомления.ТаблицаВложений     = ТаблицаВложений;
					СтруктураУведомления.ПечатныеФормы       = ПечатныеФормы;
					СтруктураУведомления.ПрисоединенныеФайлы = ТаблицаПрисоединенныхФайлов;
					СтруктураУведомления.КонтрольнаяСумма    = КонтрольнаяСумма;
					
					АдресаРасширенно = Новый Массив;
					НайденннаяСтрока = АдресатыРасширенно.Найти(СтрокаАдресата.Адресат, "Адресат");
					
					Если НайденннаяСтрока <> Неопределено Тогда
						
						АдресРасширенно = СтруктураАдресатРасширенно();
						ЗаполнитьЗначенияСвойств(АдресРасширенно, НайденннаяСтрока);
						АдресаРасширенно.Добавить(АдресРасширенно);
						
					КонецЕсли;
					
					СтруктураУведомления.АдресатыРасширенно = АдресаРасширенно;
					
					Уведомления.Добавить(СтруктураУведомления);
					
				КонецЦикла;
				
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Уведомления.Количество() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Уведомления;
	КонецЕсли;
	
КонецФункции

// Вычисляет ближайшую дату следующей рассылки
//
Функция РасписаниеРассылки(Событие) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МИНИМУМ(ДанныеСправочника.ДатаОтправки) КАК ДатаОтправки
	|ИЗ
	|	Справочник.ПЛ_УведомленияОСобытиях КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.Событие = &Событие
	|	И НЕ ДанныеСправочника.ПометкаУдаления
	|	И ДанныеСправочника.ДатаОтправки > &ТекущаяДата
	|	И ДанныеСправочника.Статус = 1
	|";
	
	Запрос.УстановитьПараметр("Событие", Событие);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить();
	
	ДатаОтправки = Неопределено;
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ДатаОтправки = Выборка.ДатаОтправки;
	КонецЕсли;
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ДатаНачала = ДатаОтправки;
	Расписание.ВремяНачала = ДатаОтправки;
	
	Возврат Расписание;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Удаляет повторяющиеся значения из перечня получателей почтовых сообщений
//
Процедура УдалитьПовторяющиесяЭлементыМассива(МассивЗначений) Экспорт
	
	Инд = 0;
	КолВо = МассивЗначений.Количество();
	
	Пока Инд < КолВо Цикл
		
		Инд2 = Инд + 1;
		
		Пока Инд2 < КолВо Цикл
			
			Если ВРег(МассивЗначений[Инд2]) = ВРег(МассивЗначений[Инд]) Тогда
				
				МассивЗначений.Удалить(Инд2);
				КолВо = КолВо - 1;
				
			Иначе
				Инд2 = Инд2 + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		Инд = Инд + 1;
		
	КонецЦикла;
	
КонецПроцедуры

// Удаляет повторяющиеся значения из перечня получателей почтовых сообщений
//
Процедура УдалитьПовторяющиесяЭлементыТаблицыЗначений(ТаблицаЗначений, ИмяКолонки) Экспорт
	
	Инд = 0;
	КолВо = ТаблицаЗначений.Количество();
	
	Пока Инд < КолВо Цикл
		
		Инд2 = Инд + 1;
		
		Пока Инд2 < КолВо Цикл
			
			Если ВРег(ТаблицаЗначений[Инд2][ИмяКолонки]) = ВРег(ТаблицаЗначений[Инд][ИмяКолонки]) Тогда
				
				ТаблицаЗначений.Удалить(Инд2);
				КолВо = КолВо - 1;
				
			Иначе
				Инд2 = Инд2 + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		Инд = Инд + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторАдресата(Адресат) Экспорт
	
	Идентификатор = "";
	
	Если ТипЗнч(Адресат) <> Тип("Строка") Тогда
		
		Попытка
			Идентификатор = Адресат.УникальныйИдентификатор();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

// Возвращает набор полей структуры уведомления
//
Функция ИнициализироватьСтруктуруУведомления()
	
	СтруктураУведомления = Новый Структура;
	СтруктураУведомления.Вставить("Уведомление");
	СтруктураУведомления.Вставить("Событие");
	СтруктураУведомления.Вставить("ИсточникСобытия");
	СтруктураУведомления.Вставить("КонтрольПовторнойОтправки");
	СтруктураУведомления.Вставить("Тема");
	СтруктураУведомления.Вставить("Текст");
	СтруктураУведомления.Вставить("ОбычныйТекст");
	СтруктураУведомления.Вставить("Адресаты", Новый Массив);
	СтруктураУведомления.Вставить("АдресатыРасширенно", Новый Массив);
	СтруктураУведомления.Вставить("ОбычныйТекст");
	СтруктураУведомления.Вставить("ДелениеПоАдресатам");
	СтруктураУведомления.Вставить("СпособДоставки");
	СтруктураУведомления.Вставить("ОбратныйАдрес");
	СтруктураУведомления.Вставить("ИмяОтправителя");
	СтруктураУведомления.Вставить("ТаблицаВложений");
	СтруктураУведомления.Вставить("ПечатныеФормы", Новый Массив);
	СтруктураУведомления.Вставить("ПрисоединенныеФайлы");
	СтруктураУведомления.Вставить("КонтрольнаяСумма");
	СтруктураУведомления.Вставить("ИдентификаторСообщения");
	
	Возврат СтруктураУведомления;
	
КонецФункции

// Возвращает адрес эл. почты, номер телефона или ссылку на пользователя для переданного адресата
//
Функция ПолучитьАдрес(ВыборкаУведомлений, Адресат)
	
	Адрес = "";
	
	Если ТипЗнч(Адресат) = Тип("Строка") И Не ВыборкаУведомлений.Напоминание Тогда
		Адрес = Адресат;
	Иначе
		
		Если ВыборкаУведомлений.ЭлПочта
			Или ВыборкаУведомлений.СервисПочтовойРассылки Тогда
			Адрес = ПЛ_УведомленияОСобытиях.АдресЭлПочты(Адресат);
		ИначеЕсли ВыборкаУведомлений.СМС Тогда
			Адрес = ПЛ_УведомленияОСобытиях.ПолучитьНомерТелефона(Адресат);
		ИначеЕсли ВыборкаУведомлений.Напоминание Тогда
			Адрес = Адресат;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Адрес;
	
КонецФункции

Функция СтруктураАдресатРасширенно()
	
	Возврат Новый Структура("Адресат, Адрес, Идентификатор");
	
КонецФункции

// Возвращает массив структур, содержащих бинарные данные сформированных печатных форм
//
Функция СформироватьПечатныеФормы(Источник, ТаблицаПечатныхФорм, ФорматВложений = "", ХешКонтрольнойСуммы)
	
	ФорматФайла = ТипФайлаТабличногоДокумента.PDF;
	
	Если ЗначениеЗаполнено(ФорматВложений) Тогда
		
		ФорматФайла = ВычислитьТипФайла(ФорматВложений);
		
		Если Не ЗначениеЗаполнено(ФорматФайла) Тогда
			ФорматФайла = ТипФайлаТабличногоДокумента.PDF;
		КонецЕсли;
		
	КонецЕсли;
	
	ВерсияУТ = ПЛ_УведомленияОСобытиях.ВерсияУТ();
	
	Если ВерсияУТ = "10" Или ВерсияУТ = "Бухгалтерия" Тогда
		
		Возврат СформироватьПечатныеФормыУТ10(Источник, ТаблицаПечатныхФорм, ФорматФайла, ХешКонтрольнойСуммы);
		
	ИначеЕсли ВерсияУТ = "11" Тогда
		
		Возврат СформироватьПечатныеФормыУТ11(Источник, ТаблицаПечатныхФорм, ФорматФайла, ХешКонтрольнойСуммы);
		
	ИначеЕсли ВерсияУТ = "Розница" Тогда
		
		Возврат СформироватьПечатныеФормыРозница(Источник, ТаблицаПечатныхФорм, ФорматФайла, ХешКонтрольнойСуммы);
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьПечатныеФормыУТ10(Источник, ТаблицаПечатныхФорм, ФорматФайла, ХешКонтрольнойСуммы)
	
	ПечатныеФормы = Новый Массив;
	
	Попытка
		СтруктураВнутреннихПечатныхФорм = Источник.ПолучитьОбъект().ПолучитьСтруктуруПечатныхФорм();
	Исключение
		СтруктураВнутреннихПечатныхФорм = Новый Структура;
	КонецПопытки;
	
	ИмяИсточника = "";
	ДеревоМакетовПечати = Неопределено;
	
	Попытка
		Выполнить("ИмяИсточника = ОбщегоНазначения.СформироватьЗаголовокДокумента(Источник.ПолучитьОбъект())");
		Выполнить("ДеревоМакетовПечати = УниверсальныеМеханизмы.ПолучитьДеревоМакетовПечати(Источник, СтруктураВнутреннихПечатныхФорм)");
	Исключение
		Возврат ПечатныеФормы;
	КонецПопытки;
	
	Если ТипЗнч(ДеревоМакетовПечати) = Тип("ДеревоЗначений") Тогда
		
		Для каждого СтрокаПечатныхФорм из ТаблицаПечатныхФорм Цикл
			
			СтрокаДерева = ДеревоМакетовПечати.Строки.Найти(СтрокаПечатныхФорм.ПечатнаяФорма, "Текст");
			
			Если СтрокаДерева = Неопределено Тогда
				СтрокаДерева = ДеревоМакетовПечати.Строки.Найти(СтрокаПечатныхФорм.ПечатнаяФорма, "Имя");
			КонецЕсли;
			
			Если СтрокаДерева <> Неопределено Тогда
				
				Расшифровка = СтрокаДерева.Расшифровка;
				
				Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
					
					ТабДокумент = Неопределено;
					
					Попытка
						Выполнить("ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Источник, Расшифровка)");
					Исключение
						
						ТекстСообщения = НСтр("ru = 'Не удалось получить печатную форму по причине: %Причина%'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
							УровеньЖурналаРегистрации.Предупреждение,
							Источник.Метаданные(),
							Источник,
							ТекстСообщения);
						
						Возврат ПечатныеФормы;
						
					КонецПопытки;
					
					ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
					
					ТабДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.TXT);
					ВремДокумент = Новый ТекстовыйДокумент;
					ВремДокумент.Прочитать(ИмяВременногоФайла);
					ТекстФайла = ВремДокумент.ПолучитьТекст();
					
					ПЛ_Функции83.ДобавитьДанныеВХеш(ХешКонтрольнойСуммы, ТекстФайла);
					
					ТабДокумент.Записать(ИмяВременногоФайла, ФорматФайла);
					
					СтруктураВложения = Новый Структура;
					СтруктураВложения.Вставить("ДвоичныеДанные",    ПолучитьДвоичныеДанные(ИмяВременногоФайла));
					СтруктураВложения.Вставить("ИмяФайла",          СтрокаПечатныхФорм.ПечатнаяФорма + " " + ИмяИсточника + "." + ?(Найти(Строка(ФорматФайла), "HTML"), "HTML", Строка(ФорматФайла)));
					СтруктураВложения.Вставить("Наименование",      СтрокаПечатныхФорм.ПечатнаяФорма + "_" + ИмяИсточника);
					
					ПечатныеФормы.Добавить(СтруктураВложения);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПечатныеФормы;
	
КонецФункции

Функция СформироватьПечатныеФормыУТ11(Источник, ТаблицаПечатныхФорм, ФорматФайла, ХешКонтрольнойСуммы)
	
	ПечатныеФормы = Новый Массив;
	
	ВнешниеПечатныеФормы = "";
	КоллекцияКомандПечати = "";
	
	Выполнить("ВнешниеПечатныеФормы = УправлениеПечатью.СписокПечатныхФормИзВнешнихИсточников(ОбщегоНазначения.ИмяТаблицыПоСсылке(Источник))");
	Выполнить("КоллекцияКомандПечати = УправлениеПечатью.СоздатьКоллекциюКомандПечати()");
	Выполнить("ОбщегоНазначения.МенеджерОбъектаПоСсылке(Источник).ДобавитьКомандыПечати(КоллекцияКомандПечати)");
	
	ИмяОбъекта = Источник.Метаданные().ПолноеИмя();
	
	Для Каждого КомандаПечати Из КоллекцияКомандПечати Цикл
		
		Если ПустаяСтрока(КомандаПечати.МенеджерПечати) Тогда
			КомандаПечати.МенеджерПечати = ИмяОбъекта;
		КонецЕсли;
		
	КонецЦикла;

	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Источник);
	
	ИмяИсточника = "";
	Выполнить("ИмяИсточника = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(Источник.ПолучитьОбъект())");
	
	Для каждого СтрокаПечатныхФорм из ТаблицаПечатныхФорм Цикл
		
		СтрокаТаблицы = КоллекцияКомандПечати.Найти(СтрокаПечатныхФорм.ПечатнаяФорма, "Представление");
		
		Если СтрокаТаблицы <> Неопределено Тогда
			
			Попытка
				КоллекцияПечатныхФорм = "";
				Выполнить("КоллекцияПечатныхФорм = УправлениеПечатью.СформироватьПечатныеФормы(СтрокаТаблицы.МенеджерПечати, СтрокаТаблицы.Идентификатор, МассивОбъектов, СтрокаТаблицы.ДополнительныеПараметры)");
			Исключение
				
				ТекстСообщения = НСтр("ru = 'Не удалось получить печатную форму по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
					УровеньЖурналаРегистрации.Предупреждение,
					Источник.Метаданные(),
					Источник,
					ТекстСообщения);
				
				Возврат ПечатныеФормы;
				
			КонецПопытки;
			
			Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм.КоллекцияПечатныхФорм Цикл
				
				Если ПечатнаяФорма = Неопределено Или ПечатнаяФорма.ТабличныйДокумент.ВысотаТаблицы = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ТабДокумент = ПечатнаяФорма.ТабличныйДокумент;
				
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
				
				ТабДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.TXT);
				ВремДокумент = Новый ТекстовыйДокумент;
				ВремДокумент.Прочитать(ИмяВременногоФайла);
				ТекстФайла = ВремДокумент.ПолучитьТекст();
				
				ПЛ_Функции83.ДобавитьДанныеВХеш(ХешКонтрольнойСуммы, ТекстФайла);
				
				ТабДокумент.Записать(ИмяВременногоФайла, ФорматФайла);
				
				СтруктураВложения = Новый Структура;
				СтруктураВложения.Вставить("ДвоичныеДанные",    ПолучитьДвоичныеДанные(ИмяВременногоФайла));
				СтруктураВложения.Вставить("ИмяФайла",          СтрокаПечатныхФорм.ПечатнаяФорма + " " + ИмяИсточника + "." + ?(Найти(Строка(ФорматФайла), "HTML"), "HTML", Строка(ФорматФайла)));
				СтруктураВложения.Вставить("Наименование",      СтрокаПечатныхФорм.ПечатнаяФорма + "_" + ИмяИсточника);
				
				ПечатныеФормы.Добавить(СтруктураВложения);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПечатныеФормы;
	
КонецФункции

Функция СформироватьПечатныеФормыРозница(Источник, ТаблицаПечатныхФорм, ФорматФайла, ХешКонтрольнойСуммы)
	
	ПечатныеФормы = Новый Массив;
	
	ВнешниеПечатныеФормы = "";
	КоллекцияКомандПечати = "";
	
	Выполнить("ВнешниеПечатныеФормы = УправлениеПечатью.СписокПечатныхФормИзВнешнихИсточников(ОбщегоНазначения.ИмяТаблицыПоСсылке(Источник))");
	Выполнить("КоллекцияКомандПечати = УправлениеПечатью.СоздатьКоллекциюКомандПечати()");
	Выполнить("ОбщегоНазначения.МенеджерОбъектаПоСсылке(Источник).ДобавитьКомандыПечати(КоллекцияКомандПечати)");
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Источник);
	
	ИмяИсточника = "";
	Выполнить("ИмяИсточника = ФормированиеПечатныхФормСервер.СформироватьЗаголовокДокумента(Источник.ПолучитьОбъект(), Источник.Метаданные().Синоним)");
	
	Для каждого СтрокаПечатныхФорм из ТаблицаПечатныхФорм Цикл
		
		СтрокаТаблицы = КоллекцияКомандПечати.Найти(СтрокаПечатныхФорм.ПечатнаяФорма, "Представление");
		
		Если СтрокаТаблицы <> Неопределено Тогда
			
			Попытка
				
				КоллекцияПечатныхФорм = "";
				Выполнить("КоллекцияПечатныхФорм = УправлениеПечатью.СформироватьПечатныеФормы(СтрокаТаблицы.МенеджерПечати, СтрокаТаблицы.Идентификатор, МассивОбъектов, СтрокаТаблицы.ДополнительныеПараметры)");
				
			Исключение
				
				ТекстСообщения = НСтр("ru = 'Не удалось получить печатную форму по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
					УровеньЖурналаРегистрации.Предупреждение,
					Источник.Метаданные(),
					Источник,
					ТекстСообщения);
				
				Возврат ПечатныеФормы;
				
			КонецПопытки;
			
			Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм.КоллекцияПечатныхФорм Цикл
				
				Если ПечатнаяФорма = Неопределено Или ПечатнаяФорма.ТабличныйДокумент.ВысотаТаблицы = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ТабДокумент = ПечатнаяФорма.ТабличныйДокумент;
				
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
				
				ТабДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.TXT);
				ВремДокумент = Новый ТекстовыйДокумент;
				ВремДокумент.Прочитать(ИмяВременногоФайла);
				ТекстФайла = ВремДокумент.ПолучитьТекст();
				
				ПЛ_Функции83.ДобавитьДанныеВХеш(ХешКонтрольнойСуммы, ТекстФайла);
				
				ТабДокумент.Записать(ИмяВременногоФайла, ФорматФайла);
				
				СтруктураВложения = Новый Структура;
				СтруктураВложения.Вставить("ДвоичныеДанные",    ПолучитьДвоичныеДанные(ИмяВременногоФайла));
				СтруктураВложения.Вставить("ИмяФайла",          СтрокаПечатныхФорм.ПечатнаяФорма + " " + ИмяИсточника + "." + ?(Найти(Строка(ФорматФайла), "HTML"), "HTML", Строка(ФорматФайла)));
				СтруктураВложения.Вставить("Наименование",      СтрокаПечатныхФорм.ПечатнаяФорма + "_" + ИмяИсточника);
				
				ПечатныеФормы.Добавить(СтруктураВложения);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПечатныеФормы;
	
КонецФункции

Функция ПолучитьДвоичныеДанные(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	
	Если Файл.Существует() Тогда
		
		Данные = Новый ДвоичныеДанные(ИмяФайла);
		
		Попытка
			УдалитьФайлы(ИмяФайла);
		Исключение
		КонецПопытки;
		
		Возврат Данные;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ВычислитьТипФайла(ФорматВложений)
	
	Для каждого ТипФайла Из ТипФайлаТабличногоДокумента Цикл
		
		Если Строка(ТипФайла) = ФорматВложений Тогда
			Возврат ТипФайла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Процедура ДобавитьТаблицуШаблонаВМассивПечатныхФорм(ПечатныеФормы, ТаблицаШаблона, АдресСхемы, ФорматФайла, ХешКонтрольнойСуммы)
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемы);
	АдресНастроек = ТаблицаШаблона.АдресНастроек;
	
	Если СхемаКомпоновкиДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	
	НастройкиКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	
	КомпоновщикНастроек.Восстановить();
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),,,);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,, Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,, "Загружает СКД в таб документ: начало");	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,, "Загружает СКД в таб документ: окончание");	

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	ТабДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.TXT);
	ВремДокумент = Новый ТекстовыйДокумент;
	ВремДокумент.Прочитать(ИмяВременногоФайла);
	ТекстФайла = ВремДокумент.ПолучитьТекст();
	
	ПЛ_Функции83.ДобавитьДанныеВХеш(ХешКонтрольнойСуммы, ТекстФайла);
	
	ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,, "Сохраняем таб документ в файл: начало");	
	ТабДокумент.Записать(ИмяВременногоФайла, ФорматФайла);
	ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,, "Сохраняем таб документ в файл: окончание");	
	
	СтруктураВложения = Новый Структура;
	СтруктураВложения.Вставить("ДвоичныеДанные",    ПолучитьДвоичныеДанные(ИмяВременногоФайла));
	СтруктураВложения.Вставить("ИмяФайла",          ТаблицаШаблона.Имя + "." + ?(Найти(Строка(ФорматФайла), "HTML"), "HTML", Строка(ФорматФайла)));
	СтруктураВложения.Вставить("Наименование",      ТаблицаШаблона.Имя);
	
	ПечатныеФормы.Добавить(СтруктураВложения);
	
КонецПроцедуры

#КонецЕсли
